MusaMahmood/nRF52_GSR_ADS1220/main.c
  err_code = nrf_drv_saadc_channel_init(0, &channel_config);
  APP_ERROR_CHECK(err_code);

  if (SAADC_BURST_MODE) {
    NRF_SAADC->CH[0].CONFIG |= 0x01000000; //Configure burst mode for channel 0. Burst is useful together with oversampling. When triggering the SAMPLE task in burst mode, the SAADC will sample "Oversample" number of times as fast as it can and then output a single averaged value to the RAM buffer. If burst mode is not enabled, the SAMPLE task needs to be triggered "Oversample" number of times to output a single averaged value to the RAM buffer.
  }

  err_code = nrf_drv_saadc_buffer_convert(&m_buffer_pool[0], SAMPLES_IN_BUFFER);
  APP_ERROR_CHECK(err_code);

  //  err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
  //  APP_ERROR_CHECK(err_code);

  nrf_drv_saadc_calibrate_offset(); //Calibrate before initialization.
}
#endif

static void wait_for_event(void) {
  (void)sd_app_evt_wait();
}

void drdy_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
  UNUSED_PARAMETER(pin);
  UNUSED_PARAMETER(action);
  
//  NRF_LOG_INFO("DRDY PIN DETECT! \r\n");

  get_gsr_data(&m_sg);

  if (m_sg.sg_ch1_count == SG_PACKET_LENGTH) {
    m_sg.sg_ch1_count = 0;
    ble_sg_update_1ch(&m_sg);
  }

}

static void ads1220_gpio_init(void) {
  nrf_gpio_pin_dir_set(ADS1220_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT);
  uint32_t err_code;
  if (!nrf_drv_gpiote_is_init()) {
    err_code = nrf_drv_gpiote_init();
  }
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_init: %d\r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  bool is_high_accuracy = true;
  nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
  in_config.is_watcher = true;
  in_config.pull = NRF_GPIO_PIN_NOPULL;
  err_code = nrf_drv_gpiote_in_init(ADS1220_DRDY_PIN, &in_config, drdy_pin_handler);
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_in_init: %d: \r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  nrf_drv_gpiote_in_event_enable(ADS1220_DRDY_PIN, true);
  //  nrf_gpio_cfg_output(BATTERY_LOAD_SWITCH_CTRL_PIN);
  //  nrf_gpio_pin_set(BATTERY_LOAD_SWITCH_CTRL_PIN); //OFF
  //#ifdef BATTERY_LOAD_SWITCH_CTRL_PIN
  //  nrf_gpio_cfg_output(BATTERY_LOAD_SWITCH_CTRL_PIN);
  //  nrf_gpio_pin_set(BATTERY_LOAD_SWITCH_CTRL_PIN); //OFF
  //#endif
}

/**@brief Function for application main entry.
 */
int main(void) {
  bool erase_bonds = false;
  uint32_t err_code = NRF_SUCCESS;
  // Initialize.
  log_init();
  timers_init();
  ble_stack_init();
  ads1220_gpio_init();
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  conn_params_init();
  m_sg.sg_ch1_count = 0;
  // ADS1220 Functions:
  //Reset?
  ads_spi_init();
  ads1220_reset();              // Reset to ensure device is properly working
  ads1220_init_default_regs();  // Write default registers
  ads1220_check_written_regs(); //Sanity Check. Dump written registers
  ads1220_start_sync();         // start converting in continuous mode
// Wait for DRDY.
#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1
  saadc_init();
#endif
  // AD5242 Init:
  ad5242_twi_init(); 
  ad5242_write_rdac1_value(0xFF);

  ad5242_twi_uninit();
  // Initialize TMP Sensor:

  // Start execution.
  application_timers_start();
  advertising_start();
  NRF_LOG_RAW_INFO(" BLE Advertising Start! \r\n");
  NRF_LOG_FLUSH();
#if LEDS_ENABLE == 1
  nrf_gpio_pin_clear(LED_2); // Green
  nrf_gpio_pin_set(LED_1);   //Blue
#endif
#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  m_samples = 0;
#endif
// Enter main loop
#if NRF_LOG_ENABLED == 1
  while (1) {
    NRF_LOG_FLUSH();
  }
#endif
}

/**
 * @}
 */